const usernameToProfileMap = {};
let nextProfileId = 1;
const MAX_PROFILE_ID = 41; 

const mockData = [
    { id: 0, username: "เฮียเส็งรับจบ"},
    { id: 1, username: "Honey_luv", comment: "กดใจรัว ๆ แล้วค่า💖" },
    { id: 2, username: "2youmybaby", comment: "กดแชร์แล้วนะค้าาา" },
    { id: 3, username: "Maengibah", comment: "สวัสดีค่าาา มาแล้วค่ะ" },
    { id: 4, username: "Flowersrosie", comment: "🤟🏻🤟🏻🤟🏻" },
    { id: 5, username: "ployploy_555", comment: "ได้ของจริงใช่มั้ยคะพี่เข็บ 🤩 อยากสุ่มบ้างงง" },
    { id: 6, username: "สาวสวยรวยยิ้ม", comment: "กรี๊ดดด รอเลยค่ะ" },
    { id: 7, username: "2youmybaby", comment: "ร้านนี้ 💯 💯" },
    { id: 8, username: "FahZa_Fah", comment: "199 เองเหรอ! รีบโอนเลย เดี๋ยวของหมด" },
    { id: 9, username: "supercutie", comment: "อยากได้ด้วยยย" },
    { id: 10, username: "@mosmos_1998", comment: "พี่เข็บครับ ผมโอนไปละ ยังไม่ได้แจ้งเลขพัสดุเลย" },
    { id: 11, username: "หน่องบัวอยากรวย", comment: "อยากได้ไอโฟนนนนน" },
    { id: 12, username: "Sungsing_g414", comment: "17 Pro Max เลยหรอคะ กรี๊ด!!!" },
    { id: 13, username: "namfahhh_h", comment: "กล่องสุ่มจริงไหม?" },
    { id: 14, username: "นุ่น สุนิสา", comment: "ได้จริงค่ะทุกคน smartwatch ของใหม่แกะกล่องเลยค่ะ" },
    { id: 15, username: "เด็กดีแต่ดวงไม่ดี", comment: "ถึงหนูจะดวงไม่ดี แต่เพื่อนหนูเคยได้หูฟังจริงค่ะ! ของดีมากก" },
    { id: 16, username: "นุ่น สุนิสา", comment: "ลุ้นนนนนๆๆ" },
    { id: 17, username: "บอสรักหมา", comment: "โหหห อยากลุ้นแล้วอ่าาา" },
    { id: 18, username: "FahZa_Fah", comment: "ยี่ห้อนี้เลยหรอออ โคตรคุ้ม" },
    { id: 19, username: "เพี้ยวฟ้าวซิตี้", comment: "อยากได้บ้างงง 🥰" },
    { id: 20, username: "แม่น้องตะวัน", comment: "❤️❤️❤️" },
    { id: 21, username: "แม่ค้าสายมู", comment: "น้องเข็บขาาา พี่กดแล้วนะคะ รอของไม่ไหวล้าว" },
    { id: 22, username: "ฟีฟ่า007_zaza", comment: "เดือนก่อนคนได้ทองเยอะมาก รอบนี้คิวผมแล้วครับ" },
    { id: 23, username: "ไม่ชอบกินมะเขือเทศ", comment: "ห้าาาา ทอง 🥺" },
    { id: 24, username: "iluvkkumak_mak", comment: "จริงหรอพี่?" },
    { id: 25, username: "นุ่น สุนิสา", comment: "ลุ้นนนนนๆๆ" },
    { id: 26, username: "บอสรักหมา", comment: "โหหห อยากลุ้นแล้วอ่าาา" },
    { id: 27, username: "FahZa_Fah", comment: "ยี่ห้อนี้เลยหรอออ โคตรคุ้ม" },
    { id: 28, username: "เพี้ยวฟ้าวซิตี้", comment: "อยากได้บ้างงง 🥰" },
    { id: 29, username: "แม่น้องตะวัน", comment: "❤️❤️❤️" },
    { id: 30, username: "แม่ค้าสายมู", comment: "น้องเข็บขาาา พี่กดแล้วนะคะ รอของไม่ไหวล้าว" },
    { id: 31, username: "ฟีฟ่า007_zaza", comment: "เดือนก่อนคนได้ทองเยอะมาก รอบนี้คิวผมแล้วครับ" },
    { id: 32, username: "ไม่ชอบกินมะเขือเทศ", comment: "ห้าาาา ทอง 🥺" },
    { id: 33, username: "iluvkkumak_mak", comment: "จริงหรอพี่?" },
    { id: 34, username: "MINTchoco.xoxo", comment: "กล่องละเท่าไหร่คะ เฮียเส็งมีโปรมั้ย" },
    { id: 35, username: "เจ๊ข้างบ้าน", comment: "ของดีขนาดนี้ ไม่ถึงห้าร้อยไม่เชื่อหรอก" },
    { id: 36, username: "@NattNatt47", comment: "เฮียเส็งคือใครคะ ทำไมไม่เคยเห็น 😂" },
    { id: 37, username: "user639218", comment: "พี่คะ มีทองจริงป่าว หรือพูดเอามันส์" },
    { id: 38, username: "หน่องบัวอยากรวย", comment: "ได้ทองจริงนะคะ! ส่งไวมากเลยด้วย" },
    { id: 39, username: "@user020402", comment: "เฮียเส็งรับจบ หรือรับตังค์หนูจบกันแน่คะ" },
    { id: 40, username: "ขอนแก่นจริงใจ", comment: "5555555555" },
    { id: 41, username: "พี่สมรโคกตูม", comment: "ผ่านเข้ามา ข่าเฉย 😂😂😂😂" },
    { id: 42, username: "Jaiii.eiei", comment: "เข็บพูดน่ารักจัง แต่กลัวโดนหลอกอ่า" },
    { id: 43, username: "หน่องบัวอยากรวย", comment: "ของดีขนาดนี้ ไม่รีบซื้อคือพลาดนะทุกคน!! 🔥" },
    { id: 44, username: "ลูกแม่เบสท์", comment: "กดแล้วครับบบ" },
    { id: 45, username: "FCesanlovegroupeiei", comment: "เรียบร้อยค่ะเข็บ รอของน้าา" },
    { id: 46, username: "999_pimon", comment: "🤟🏻" },
    { id: 47, username: "หน่องบัวอยากรวย", comment: "พี่กดเพิ่มไปแล้ว เมื่อกี้เลยค่ะ💚" },
    { id: 48, username: "ดีดีดี้ดีดี", comment: "หนูซื้อแล้วนะคะพี่เข็บ 🫰" },
    { id: 49, username: "Yarkmeekwamruk", comment: "กรี๊ดดดด ทันๆๆๆ!" },
    { id: 50, username: "FCesanlovegroupeiei", comment: "รอของนะคะ👉🏻❤️" },
    { id: 51, username: "@User152614", comment: "ทันนน!! ทันค่ารอบนี้" }
];


const MOCK_DATA = mockData.map(item => {

    if (item.id === 0) {
        return {
            ...item,
            profilePicture: '/seller-profile.png'
        };
    }

    //ใช้ profileId เดิมถ้า username ซ้ำ
    if (!usernameToProfileMap[item.username]) {
        const currentProfileId = nextProfileId <= MAX_PROFILE_ID ? nextProfileId++ : MAX_PROFILE_ID;
        usernameToProfileMap[item.username] = currentProfileId;
    }

    const profileId = usernameToProfileMap[item.username];
    const imageFileName = `comment-profile-id-${profileId}.jpg`;

    const relativePath = `/comment-profiles/${imageFileName}`;

    const profilePictureUrl = new URL(relativePath, import.meta.url).href;

    return {
        ...item,
        profilePicture: profilePictureUrl
    };
});

export default MOCK_DATA;